<script lang="ts" setup>

</script>

<template>
  <div role="main">
    <section class="py-6 px-2 w-full">
      <div class="px-1">
        <h1 class=" font-bold text-2xl text-center">纠纷处理</h1>
        <p>
          深圳市顺晨网络科技有限公司营运的手机游戏平台（以下简称顺晨网络）在此特别提醒用户在注册、登陆本手机游戏前请务必仔细阅读本《纠纷处理》及《用户使用协议》（未成年人应当在其法定监护人陪同下阅读）中的各个条款，以确保您在享受本手机游戏服务的同时维护自身合法权益：
        </p>
        <p class=" text-xl font-bold">一、用户之间纠纷处理方式</p>
        <p>
          1．顺晨网络仅作为本手机游戏的运营商，如若本手机游戏用户之间发生纠纷且无法协商一致的，可向国家相关行政机关或司法机关寻求解决包括但不限于向公安机关报案、申请仲裁或向人民法院提起诉讼等。顺晨网络将会为实名注册用户提供必要的协助和支持，并根据有关行政机关和司法机关的要求承担一定的举证责任或采取必要措施。
        </p>
        <p>
          2．本手机游戏用户之间发生纠纷的，也可向顺晨网络的客服人员投诉并举证。用户需提供与其账号注册信息一致的个人有效身份证件、必要的国家行政或司法机关文件和其他中博互动要求提供的相关证据。经审核确认后，可以给予必要的协助和支持。
        </p>
        <p class="text-xl font-bold">二、用户与顺晨网络之间纠纷处理方式</p>
        <p>
          1．如本手机游戏用户对顺晨网络的服务有任何异议的，可以向顺晨网络的客服人员投诉并举证。查证属实的，顺晨网络将立即更正并按照现
        </p>
        <p>
          2．如本手机游戏用户对顺晨网络的服务有任何异议的，也可以向双方约定（具体参见《用户使用协议》）的顺晨网络公司所在地人民法院提起诉讼。
        </p>
      </div>
    </section>
  </div>
</template>
<style scoped>
p {
  @apply indent-[2em] mb-2
}

</style>
