<template>
  <div class="main">
    <section class="py-6 px-2 w-full">
      <div class="px-1">
        <div class="text-start">
          <p>版本更新日期：2023年7月31日</p>
          <p>版本生效日期：2022年06月30日</p>
        </div>
        <p class="text-2xl font-bold text-center">用户隐私协议</p>
        <p>
          根据文化部制定的《网络游戏管理暂行办法》及《网络游戏服务格式化协议必备条款》的相关规定，为保障网络游戏用户（下称“用户”）的隐私权，规范对网络游戏用户个人信息的利用，特制定本政策。请用户（未成年人应当在其法定监护人陪同下阅读）仔细阅读以下全部内容。如用户不同意本政策的任意内容，请不要注册或使用公司提供的服务。如用户通过进入注册程序并勾选“我同意游戏用户个人信息和隐私保护政策”，<span
            class="text-red-600"
            >即表示用户与深圳市顺晨网络科技有限公司</span
          >已达成协议，自愿接受本政策的所有内容。此后，用户不得以未阅读本政策的内容为由作任何形式的抗辩。
        </p>
        <p class="text-xl font-bold">一、我们可能收集的信息</p>
        <p>
          用户同意在注册游戏账号时或进入游戏、参加相关活动时提供给公司的个人身份信息及与个人身份无关的信息，包括用户注册资料中的用户姓名、个人有效身份证件号码、家庭住址、联系方式（电话号码、电子邮箱）、设备信息(读取WIFI的BSSID、SSID、设备MAC地址、设备识别码、设备序列号、SIM卡信息、ANDROID
          ID、OAID、MEID、IMEI、IMSI、设备位置信息/IP地址、设备媒体信息)、相关日志信息、登陆IP、搜索及购买记录，亦包括用户对本软件的操作状态以及使用习惯一些明确且客观反映在公司、关联公司、合作单位服务器端的基本记录信息和其他一切个人身份信息范围外的普通信息。
        </p>
        <p class="text-xl font-bold">
          二、我们如何存储和使用收集的信息(目的、方式、范围)
        </p>
        <p>
          1.为了维护基本业务功能运行、优化产品性能，保障您正常使用我们的服务，我们会在您使用本公司服务过程中收集以下信息，如您不同意收集将导致产品无法正常运行，我们将无法为您提供您所需的服务：
        </p>
        <p>
          （1）为实现基本业务功能正常运行，我们会收集您使用的设备信息，例如您的移动设备的品牌、型号、版本、配置（存储内存信息）、设备MAC地址、设备识别码、平台、语言、IP地址；
        </p>
        <p>
          （2）为保障您的权益，我们将通过获取手机唯一ID标识（IMEI/OAID/IMSI），生成您的游戏账号，将游戏账号和对应的游戏数据保存，以降低数据丢失的风险；
        </p>
        <p>
          （4）为了您能够在客户端查看您的历史记录，同时用于我们的运营统计分析、客户投诉处理及其他分析，我们会收集您的日志信息，例如登录日志、交友记录、以及您通过公司服务进行通讯的信息；
        </p>
        <p>
          （5）为保障您的游戏账号安全，营造公平、安全的网络环境，我们会收集您的游戏识别信息、硬件信息、软件使用记录及软件列表，以用于打击破坏网络公平环境或干扰、破坏游戏服务正常进行的行为（如用于监测盗版、扫描外挂、防止作弊）；
        </p>
        <p>
          （6）当您使用消费功能时，我们会收集您的充值记录、消费记录信息，以便您查询您的交易记录，同时尽最大程度保护您的财产安全。请您注意，充值记录、消费记录属于敏感信息，收集上述信息为实现公司提供消费功能所必须，否则将无法完成交易。
        </p>
        <p>
          （7）我们会在您打开游戏的时候获取设备传感器（加速传感器和重力传感器），当您进行上下翻转，左右翻转时便于sdk进行适配。
        </p>
        <p>
          （8）我们会在您打开游戏的时候会请求获取设备位置信息/IP地址(非必须)，地区排行榜、玩家同城好友，提高玩家归属感。
        </p>
        <p>
          （9）第三方Bugly
          SDK会根据IMSI\IMEI设备标识进行错误信息收集，以便后续优化体验。
        </p>
        <p>
          2.为了向您提供更加优质的服务，我们会在获取您的授权同意后收集以下信息，如您不同意收集可能导致相关服务无法进行，您也可通过管理手机设备的设置来选择是否授权我们收集相关信息：
        </p>
        <p>
          （1）为了实现将游戏数据储存至您所使用的设备中，我们需要读取、写入您的外置存储卡，以便SDK写入数据文件至外部存储卡、以及读取存储在外部存储卡中的数据文件。——同意读取、写入外置存储卡
        </p>
        <p>
          （2）为了避免系统出现报错，我们需要您允许装载和卸载文件系统权限，帮助我们了解拓展磁盘卸载和挂载状态，以用于决策广告缓存文件存放的位置。——允许装载和卸载文件系统权限
        </p>
        <p>
          （3）为了您在设备低电量情况下减少SDK的执行，帮助您降低耗电量，我们将读取您的电池状况，为您提供更加优质的服务体验。——允许读取电池状况
        </p>
        <p>
          3、在现有设备及技术条件下，公司一贯积极地采取技术与管理合理措施保障用户账号的安全、有效；公司将善意使用收集的信息，采取各项有效且必要的措施以保护您的隐私安全，并使用商业上合理的安全技术措施来保护您的隐私不被未经授权的访问、使用或泄漏。
        </p>
        <p>
          4、我们仅允许有必要知晓这些信息的员工访问您的信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您的信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任。
        </p>
        <p>
          5、除非法律另有规定或您根据本隐私政策提出请求，在游戏服务中的大部分个人信息，我们在游戏运营期间内都会保存，但有如下例外：
        </p>
        <p>
          （1）除非特别声明，营销活动中获得的个人信息，在营销活动结束后将不再保留；
        </p>
        <p class="text-red-600">
          （2）您在注册或账号认证时提供的电子邮箱地址、电话号码个人信息，自您最后一次登录游戏之日起保存两年。
        </p>
        <p class="text-red-600">
          （3）您通过客服服务提供的姓名、电子邮箱地址个人信息，自您提供之日起保存两年。
        </p>
        <p>
          6、当我们根据本隐私政策不再保存您的个人信息时，存储个人信息的电子档案将被永久删除，我们会采取合理措施确保个人信息不能被恢复。如根据法律规定我们应继续保存您的个人信息，这部分个人信息也将与其它类型信息隔离保存。
        </p>
        <p class="text-xl font-bold">三、我们可能分享、转让和披露信息</p>
        <p>
          因业务所需，公司需与公司的关联公司共享用户信息，公司及上述关联公司承诺将善意使用其个人信息，公司将不会向除关联公司外的任何其他方公开或共享用户注册资料中的姓名、个人有效身份证件号码、家庭住址、联系方式（电话号码、电子邮箱）、设备信息、登陆IP、搜索及购买记录个人信息以及存在公司各项服务中的非公开内容，但下列情况除外：
        </p>
        <p>
          （1）经用户本人(或用户监护人)书面授权或应用户本人（或其监护人）的书面要求而授权公司披露的；
        </p>
        <p>（2）有关法律要求公司披露的；</p>
        <p>（3）司法机关或行政机关基于法定程序要求公司提供的；</p>
        <p>（4）公司为了维护自己合法权益而向用户提起诉讼或者仲裁时；</p>
        <p>（5）应用户监护人的合法要求而提供用户个人身份信息时；</p>
        <p>（6）保护公司、关联公司、合作单位的知识产权等合法权益；</p>
        <p>（7）根据《通行证服务条款》的相关规定或者公司认为必要的其他情况。</p>
        <p class="text-xl font-bold">四、我们如何使用Cookies及相关技术</p>
        <p>
          为提高您的使用体验，我们会使用Cookies或类似技术（例如：webbeacons,logfiles,scripts,eTags）(以下统称“Cookies”技术)。Cookies技术将在您的设备中生成小文件，以便我们提供特定功能。您有权通过设备或浏览器的设置开启或关闭Cookies技术。但当您选择关闭Cookies技术后，您可能无法体验我们游戏服务的部分功能。
        </p>

        <p class="text-xl font-bold">五、接入第三方SDK清单</p>
        <p class="text-red-600">
          1、支付宝
          <br />
          运营主体：支付宝（中国）网络技术有限公司
          <br />
          官网链接：https://opendocs.alipay.com/open/01g6qm#iOS%20%C2%A0SDK
          <br />
          使用目的：当您在购买平台商品或服务时，为方便您完成相关支付行为
          <br />
          收集个人信息类型：授权信息、设备信息（如IMEI/IMSI、SIM卡序列号/MAC地址、android_id）、网络信息以及地理位置信息
          <br />
        </p>
        <p class="text-red-600">
          2、微信支付
          <br />
          运营主体：财付通支付科技有限公司
          <br />
          官网链接：https://pay.weixin.qq.com/index.php/public/apply_sign/protocol_v2
          <br />
          使用目的：当您在购买平台商品或服务时，为方便您完成相关支付行为
          <br />
          收集个人信息类型：微信支付授权信息、Mac地址、IMEI、Android_id、IMSI
          <br />
        </p>

        <p class="text-red-600">
          3、腾讯bugly
          <br />
          运营主体：腾讯科技有限公司
          <br />
          官网链接：http://bugly.qq.com/v2/contract
          <br />
          使用目的：为提高服务稳定性，便于相关服务崩溃后快速准确定位存在问题
          <br />
          收集个人信息类型：Crash环境（Crash信息及线程堆栈，ROM/RAM/SD卡容量、网络/语言状态App信息：包名、版本、所属进程名）、设备信息、设备厂商、设备名称、操作系统版本、运营商代码，App运行状态，闪退、卡顿、网络信息、日志信息
          <br />
        </p>
        <p class="text-red-600">
          4、友盟数据统计SDK
          <br />
          SDK使用目的：用户行为分析
          <br />
          SDK描述：辅助应用统计新增用户，活跃用户，启动次数，累计用户等数据
          <br />
          SDK使用业务场景：统计应用新增用户，活跃用户，启动次数，累计用户等数据
          <br />
          SDK使用个人信息字段：设备ID信息（IMEI/android
          ID/IMSI)、Mac地址、读写外部存储
          <br />
          第三方机构名称：友盟同欣（北京）科技有限公司
          <br />
          官网链接：https://www.umeng.com/
          <br />
        </p>
        <p class="text-red-600">
          5、友盟组件化基础库
          <br />
          SDK使用目的：用户行为分析
          <br />
          SDK描述：辅助应用统计新增用户，活跃用户，启动次数，累计用户等数据<br />
          SDK使用业务场景：统计应用新增用户，活跃用户，启动次数，累计用户等数据<br />
          SDK使用个人信息字段：设备ID信息（IMEI/android
          ID/IMSI)、Mac地址，位置信息，读写外部存储、正在运行应用<br />
          第三方机构名称：友盟同欣（北京）科技有限公司<br />
          官网链接：https://www.umeng.com/
          <br />
        </p>

        <p class="text-xl font-bold">六、免责条款</p>
        <p class="text-red-600">
          除上述规定属免责外，下列情况时公司亦无需承担任何责任：
        </p>
        <p class="text-red-600">
          （1）由于用户将用户账户密码告知他人、用户通过非公司认可的交易平台进行虚拟物品道具交易、用户未保管好自己的密码或与他人共享游戏注册账号、游戏角色、用户使用第三方软件或任何其他非公司的过错，由此导致的任何个人资料泄露；
        </p>
        <p class="text-red-600">
          （2）任何由于黑客攻击、计算机病毒侵入或发作、电信部门技术调整导致的影响、因政府管制而造成的暂时性关闭、由于第三方原因(包括不可抗力，例如国际出口的主干链路及国际出口电信提供商一方出现故障、火灾、水灾、雷击、地震、洪水、台风、龙卷风、火山爆发、瘟疫和传染病流行、罢工、战争或暴力行为或类似事件)及其他非因公司过错而造成的用户个人资料泄露、丢失、被盗用或被窜改，以及由此给用户和第三方造成的任何损失；
        </p>
        <p class="text-red-600">
          （3）由于与公司、关联公司链接的其它网站所造成的用户个人资料泄露及由此而导致的任何法律争议和后果；
        </p>
        <p class="text-red-600">
          （4）任何个人用户，包括未成年人用户向公司提供错误、不完整、不实信息造成不能通过认证、不能正常使用公司服务或遭受任何其他损失。
        </p>
        <p class="text-xl font-bold">七、未成年人限制</p>
        <p class="text-red-600">
          我们将根据国家相关法律法规的规定保护未成年人的相关信息。我们建议未成年人鼓励他们的父母或监护人阅读本《用户隐私协议》，并建议未成年人在提交信息之前寻求父母或监护人的同意和指导。
        </p>
        <p class="text-xl font-bold">八、您如何管理自己的信息</p>
        <p>
          您有权禁止我们继续处理您的个人信息、更正不准确的个人信息或要求删除您的个人信息（依据中华人民共和国法律禁止更改或删除的信息除外）。如您需要，您可联系shunchen@shunchenkj.com，并根据指示填写相关信息。我们会根据您的请求内容和您提供的信息，判断您的请求是否成立。一旦您的请求成立，我们将在合理期限内满足您的请求。
        </p>
        <p class="text-red-600">
          请您理解。由于技术所限、法律或监管要求，我们可能无法满足您的所有要求，我们会在合理的期限内答复您的请求。
        </p>
        <p class="text-xl font-bold">九、政策变更</p>
        <p class="text-red-600">
          本隐私政策内容如发生任何实质性变更，我们会在变更生效前通知您并重新获得您的同意，如您不同意变更后的内容，您可以选择停止使用我们的服务；如您仍然继续使用我们服务的，即表示同意受经修订的本《用户隐私协议》的约束。
        </p>
        <p class="text-xl font-bold">十、联系我们</p>
        <p>
          如您有关于网络信息安全的投诉和举报，或您对本《用户隐私协议》、您的信息的相关事宜有任何问题、意见或建议，以及有关本声明或游戏的隐私措施的问题请与我们联系。<span
            class="text-red-600"
            >您可通过电子邮件（邮箱地址：shunchen@shunchenkj.com）发送您的意见或邮寄至如下地址：</span
          >
        </p>
        <p class="text-red-600">地址：深圳市宝安区甲岸路易尚创意科技大厦1403</p>
        <p class="text-red-600">邮编：518000</p>
        <p>
          特别提示：本政策仅适用于使用深圳市顺晨网络公司在线游戏服务的网络游戏用户，本政策为《通行证服务条款》等公司相关游戏的服务协议的补充，若相关条款对于用户隐私保护和信息使用的约定不一致的，以本政策约定为准。本政策的修改权和解释权均属于深圳市顺晨网络科技有限公司。
        </p>
        <div class="text-end">
          <p>深圳市顺晨网络科技有限公司</p>
          <p>二〇一八年九月</p>
        </div>
      </div>
    </section>
  </div>
</template>

<script lang="ts" setup></script>

<style scoped>
p {
  @apply indent-[2em] mb-2;
}
</style>
